# Document Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuplicateTypeNamesHandlerArgs..::..Document Property
DuplicateTypeNamesHandlerArgs Class See Also
---
The document that contains the types with duplicate names.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Document Document { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Document As Document
	Get
```

Visual C++
---
```text
public:
property Document^ Document {
	Document^ get ();
}
```

# See Also
DuplicateTypeNamesHandlerArgs Class
Autodesk.Revit.DB Namespace